schreibfaul1/ESP32-MiniWebRadio/src/common.h
            // if(m_settings->irbuttons[m_numOfIrButtons].val == -1) log_w("IR_buttonNr %02i, value -1,   label %s", m_numOfIrButtons, m_settings->irbuttons[m_numOfIrButtons].label);
            //  else log_w("IR_buttonNr %02i, value 0x%02X, label %s", m_numOfIrButtons, m_settings->irbuttons[m_numOfIrButtons].val, m_settings->irbuttons[m_numOfIrButtons].label);
            m_numOfIrButtons++;
        }
        m_settings->numOfIrButtons = m_numOfIrButtons;
        return m_numOfIrButtons;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class SD_content {
private:
    struct FileInfo {
        int32_t  fileSize;
        char*    fileName;
        char*    filePath;
    };
    std::vector<FileInfo> m_files;

    File m_masterFile;
    File m_slaveFile;
    char* m_buff = NULL;
    char* m_lastConnectedFile = NULL;
    char* m_lastConnectedFolder = NULL;
    char* m_lastConnectedFileName = NULL;
public:
    SD_content(){
        m_buff = x_ps_malloc(1024);
        freeFilesVector();
    }
    ~SD_content(){
        freeFilesVector();
        if(m_buff){free(m_buff); m_buff = NULL;}
    }
    bool listFilesInDir(const char* path, boolean audioFilesOnly, boolean withoutDirs){
        if(!m_buff) {log_e("oom"); return false;}
        freeFilesVector();
        if(m_masterFile) m_masterFile.close();
        if(!SD_MMC.exists(path)) {
            SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s not exist", path);
            return false;
        }
        m_masterFile = SD_MMC.open(path);
        if(!m_masterFile.isDirectory()) {
            SerialPrintfln(ANSI_ESC_RED "SD_MMC/%s is not a directory", path);
            m_masterFile.close();
            return false;
        }
        while(true) { // get content
            m_slaveFile = m_masterFile.openNextFile();
            if(!m_slaveFile) break;
            if(m_slaveFile.isDirectory()) {
                if(!withoutDirs) { // folder size is -1
                    m_files.emplace_back((int) -1, x_ps_strdup(m_slaveFile.name()), x_ps_strdup(m_slaveFile.path()));
                }
            }
            else {
                if(audioFilesOnly) {
                    if(endsWith(m_slaveFile.name(), ".mp3") || endsWith(m_slaveFile.name(), ".aac") || endsWith(m_slaveFile.name(), ".m4a") || endsWith(m_slaveFile.name(), ".wav") || endsWith(m_slaveFile.name(), ".flac") ||
                       endsWith(m_slaveFile.name(), ".m3u") || endsWith(m_slaveFile.name(), ".opus") || endsWith(m_slaveFile.name(), ".ogg")) {
                        m_files.emplace_back(m_slaveFile.size(), x_ps_strdup(m_slaveFile.name()), x_ps_strdup(m_slaveFile.path()));
                    }
                }
                else {
                    m_files.emplace_back(m_slaveFile.size(), x_ps_strdup(m_slaveFile.name()), x_ps_strdup(m_slaveFile.path()));
                }
            }
        }
        sort();
        m_masterFile.close();
        return true;
    }

    bool isDir(uint16_t idx){
        if(idx >= m_files.size()) {log_e("idx %i is oor, max = %i", idx, m_files.size() - 1); return false;}
        if(m_files[idx].fileSize == -1) return true;
        return false;
    }
    size_t getSize(){
        return m_files.size();
    }
    const char* getColouredSStringByIndex(uint16_t idx){
        if(idx >= m_files.size()) {log_e("idx %i is oor, max = %i", idx, m_files.size() - 1); return "";}
        if(isDir(idx)) return m_files[idx].fileName;
        sprintf(m_buff, "%s" ANSI_ESC_YELLOW " %li" , m_files[idx].fileName, m_files[idx].fileSize);
        return m_buff;
    }
    const char* getFileNameByIndex(uint16_t idx){
        if(idx >= m_files.size()) {log_e("idx %i is oor, max = %i", idx, m_files.size() - 1); return "";}
        return m_files[idx].fileName;
    }

    int32_t getFileSizeByIndex(uint16_t idx){
        if(idx >= m_files.size()) {log_e("idx %i is oor, max = %i", idx, m_files.size() - 1); return 0;}
        return m_files[idx].fileSize;
    }

    const char* getFilePathByIndex(uint16_t idx){
    /*
        dir_a
            dir_b
                file_a
                file_b
            file_c
            file_d

        getFilePathByIndex(0) returns "/dir_a"
        getFilePathByIndex(3) returns "/dir_a/dir_b/file_b"
        getFilePathByIndex(5) returns "/dir_a/file_d"
    */
        if(idx >= m_files.size()) {log_e("idx %i is oor, max = %i", idx, m_files.size() - 1); return "";}
        return m_files[idx].filePath;
    }

    const char* getFileFolderByIndex(uint16_t idx){
    /*
        dir_a
            dir_b
                file_a
                file_b
            file_c
            file_d

        getFileFolderByIndex(0) returns "/dir_a"
        getFileFolderByIndex(1) returns "/dir_a/dir_b"
        getFileFolderByIndex(5) returns "/dir_a"
    */

        if(idx >= m_files.size())  {log_e("idx %i is oor, max = %i", idx, m_files.size() - 1); return "";}
        if(isDir(idx)) return m_files[idx].filePath;
        int lastSlashIndex = lastIndexOf(m_files[idx].filePath, '/');
        strcpy(m_buff, m_files[idx].filePath);
        m_buff[lastSlashIndex] = '\0';
        return m_buff;
    }

    int16_t getIndexByName(const char* path){
    /*
        dir_a
            dir_b
                file_a
                file_b
            file_c
            file_d

        getIndexByName("/dir_a") returns 0
        getIndexByName("/dir_a/dir_b/file_b") returns 3
        getIndexByName("/dir_a/dir_b/file_y") returns -1
    */
        if(!path) return -1;
        for(int i = 0; i <  m_files.size(); i++){
            if(strcmp((const char*)m_files[i].filePath, path) == 0){
                return i;
            }
        }
        return -1;
    }

    uint16_t getNextAudioFile(uint16_t currIdx){ // assume listFilesInDir with "audioFilesOnly"
        if(m_files.size() == 0) return 0;
        if(currIdx >= m_files.size()) currIdx = m_files.size() -1;
        int16_t newIdx = currIdx;
        while(true){
            newIdx++;
            if(newIdx >= m_files.size()) newIdx = 0;
            if(newIdx == currIdx) break; // avoid an infinite loop
            if(!endsWith(m_files[newIdx].fileName, ".m3u")) break; // skip m3u files
        }
        return newIdx;
    }

    uint16_t getPrevAudioFile(uint16_t currIdx){ // assume listFilesInDir with "audioFilesOnly"
        if(m_files.size() == 0) return 0;
        if(currIdx >= m_files.size()) currIdx = m_files.size() -1;
        int16_t newIdx = currIdx;
        while(true){
            newIdx--;
            if(newIdx == -1) newIdx = m_files.size() - 1;
            if(newIdx == currIdx) break; // avoid an infinite loop
            if(!endsWith(m_files[newIdx].fileName, ".m3u")) break; // skip m3u files
        }
        return newIdx;
    }

