schreibfaul1/ESP32-MiniWebRadio/src/common.h
            }
            m_oldAlarmDigits[i] = m_alarmDigits[i];
        }
    }
    void updateAlarmDaysAndTime(){
        tft.setFont(m_fontSize);
        uint8_t mask = 0b00000001;
        uint16_t color = TFT_BLACK;
        for(int i = 0; i < 7; i++){
            // alarmDays
            if(*m_alarmDays & mask) color = TFT_RED;
            else color = TFT_DARKGREY;
            tft.drawRect(m_alarmdaysXPos[i], m_alarmdaysYPos, m_alarmdaysW, m_alarmdaysH, color);
            tft.setTextColor(color);
            tft.writeText(m_WD[i], m_alarmdaysXPos[i], m_alarmdaysYPos, m_alarmdaysW, m_alarmdaysH, TFT_ALIGN_CENTER, true);
            // alarmTime
            if(*m_alarmDays & mask){
            //    tft.fillRect(m_alarmdaysXPos[i], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_BLACK);
                tft.drawRect(m_alarmdaysXPos[i], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_GREEN);
                tft.setTextColor(TFT_GREEN);
                char hhmm[10] = "00:00";
                sprintf(hhmm, "%02d:%02d", m_alarmTime[i] / 60, m_alarmTime[i] % 60);
                tft.writeText(hhmm, m_alarmdaysXPos[i], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_ALIGN_CENTER, true);
            }
            else{
                tft.fillRect(m_alarmdaysXPos[i], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_BLACK);
                tft.drawRect(m_alarmdaysXPos[i], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_DARKGREY);
            }
            mask <<= 1;
        }
    }
    void alarmDaysPressed(uint8_t idx){
        tft.setFont(m_fontSize);
        tft.drawRect(m_alarmdaysXPos[idx], m_alarmdaysYPos, m_alarmdaysW, m_alarmdaysH, TFT_YELLOW);
        tft.setTextColor(TFT_YELLOW);
        tft.writeText(m_WD[idx], m_alarmdaysXPos[idx], m_alarmdaysYPos, m_alarmdaysW, m_alarmdaysH, TFT_ALIGN_CENTER, true);
    }
    void alarmTimePressed(uint8_t idx){
        uint8_t mask = 0b00000001;
        mask <<= idx;
        if(mask & *m_alarmDays){ // bit is set -> active
            tft.setFont(m_fontSize);
            tft.fillRect(m_alarmdaysXPos[idx], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_BLACK);
            tft.drawRect(m_alarmdaysXPos[idx], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_YELLOW);
            tft.setTextColor(TFT_YELLOW);
            m_alarmTime[idx] = (m_alarmDigits[0] * 10 + m_alarmDigits[1]) * 60  + (m_alarmDigits[2] * 10 + m_alarmDigits[3]);
            char hhmm[10] = "00:00";
            sprintf(hhmm, "%02d:%02d", m_alarmTime[idx] / 60, m_alarmTime[idx] % 60);
            tft.writeText(hhmm, m_alarmdaysXPos[idx], m_alarmtimeYPos, m_alarmdaysW, m_alarmdaysH, TFT_ALIGN_CENTER, TFT_ALIGN_CENTER, true);
        }
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class dlnaList : public RegisterTable {
private:
    int16_t                   m_x = 0;
    int16_t                   m_y = 0;
    int16_t                   m_w = 0;
    int16_t                   m_h = 0;
    int16_t                   m_oldX = 0;
    int16_t                   m_oldY = 0;
    uint8_t*                  m_dlnaLevel;
    uint8_t                   m_fontSize = 0;
    uint8_t                   m_lineHight = 0;
    uint8_t                   m_browseOnRelease = 0;
    uint8_t                   m_itemListPos = 0;
    int8_t                    m_currDLNAsrvNr = -1;
    int16_t                   m_currItemNr = -1;
    uint16_t                  m_dlnaMaxItems = 0;
    uint32_t                  m_bgColor = 0;
    bool                      m_enabled = false;
    bool                      m_clicked = false;
    bool                      m_state = false;
    char*                     m_name = NULL;
    char*                     m_pathBuff = NULL;
    char*                     m_chptr = NULL;
    char*                     m_buff = NULL;
    char*                     m_dlnaItemsPos = NULL;
    DLNA_Client::dlnaServer_t m_dlnaServer;
    DLNA_Client::srvContent_t m_srvContent;
    DLNA_Client*              m_dlna;
    dlnaHistory*              m_dlnaHistory = NULL;
    releasedArg               m_ra;

public:
    dlnaList(const char* name, DLNA_Client *dlna, dlnaHistory* dh, uint8_t dhSize){
        register_object(this);
        if(name) m_name = x_ps_strdup(name);
        else     m_name = x_ps_strdup("dlnaList");
        m_dlna    = dlna;
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        m_state = false;
        m_pathBuff = x_ps_malloc(50);
        m_dlnaItemsPos = x_ps_malloc(30);
        m_ra.arg1 = NULL;
        m_ra.arg2 = NULL;
        m_ra.val1 = 0;
        m_ra.val2 = 0;
        m_dlnaHistory = dh;
    }
    ~dlnaList(){
        if(m_name){free(m_name); m_name = NULL;}
        if(m_buff){free(m_buff); m_buff = NULL;}
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint8_t fontSize){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_fontSize = fontSize;
        m_enabled = false;
        m_lineHight = m_h / 10;
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(int8_t number, DLNA_Client::dlnaServer_t dlnaServer, DLNA_Client::srvContent_t srvContent, uint8_t* dlnaLevel,  uint16_t maxItems){
        m_browseOnRelease = 0;
        m_dlnaServer = dlnaServer;
        m_srvContent = srvContent;
        m_dlnaLevel  = dlnaLevel;
        if(m_dlnaLevel == 0) m_currDLNAsrvNr = number;
        m_clicked = false;
        m_enabled = true;
        m_dlnaMaxItems = maxItems;
        dlnaItemsList();
    }
    void hide(){
        m_enabled = false;
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
    }
    void disable(){
        m_enabled = false;
    }
    bool positionXY(uint16_t x, uint16_t y){ // called every tine if x or y has changed
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_clicked == false){m_oldX = x; m_oldY = y;}
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
        return true;
    }
    bool released(uint16_t x, uint16_t y){
        if(!m_enabled) return false;
        if(!m_clicked) return false;

        hasReleased(x - m_x, y - m_y);
        m_clicked = false;

        if(m_chptr) {
            tft.setTextColor(TFT_CYAN);
            tft.setFont(m_fontSize);
            tft.writeText(m_chptr, 20, m_y + (m_itemListPos) * m_lineHight, m_w - 20, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
            m_chptr = NULL;
            vTaskDelay(300);
        }
        if(m_buff){free(m_buff); m_buff = NULL;}

