schreibfaul1/ESP32-MiniWebRadio/src/common.h
        if(guard2){ // is file
            if(startsWith(m_srvContent.itemURL[m_itemListPos - 1], "http")){
                if(m_srvContent.isAudio[m_itemListPos - 1]){
                    sprintf(m_buff, "%s",m_srvContent.title[m_itemListPos - 1]);
                    m_chptr = m_buff;
                    m_ra.arg1 = m_srvContent.itemURL[m_itemListPos - 1]; // url --> connecttohost()
                    m_ra.arg2 = m_srvContent.title[m_itemListPos - 1];   // filename --> showFileName()
                    if(m_ra.arg1 && m_ra.arg2) m_ra.val1 = 1;
                    m_browseOnRelease = 0;
                    goto exit;
                }
            }
        }

        if(guard3){ // is folder
            m_currItemNr = -1;
            sprintf(m_buff, "%s (%d)",m_srvContent.title[m_itemListPos - 1], m_srvContent.childCount[m_itemListPos - 1]);
            (*m_dlnaLevel) ++;
            m_chptr = m_buff;
            if(m_dlnaHistory[*m_dlnaLevel].objId){free(m_dlnaHistory[*m_dlnaLevel].objId); m_dlnaHistory[*m_dlnaLevel].objId = NULL;}
            m_dlnaHistory[*m_dlnaLevel].objId = strdup(m_srvContent.objectId[m_itemListPos -1]);
            if(m_dlnaHistory[*m_dlnaLevel].name){free(m_dlnaHistory[*m_dlnaLevel].name); m_dlnaHistory[*m_dlnaLevel].name = NULL;}
            m_dlnaHistory[*m_dlnaLevel].name = strdup(m_srvContent.title[m_itemListPos - 1]);
            m_browseOnRelease = 3;
            goto exit;
        }
        // log_i("at this position is nothing to do");
exit:
        return;
    }
};
//——————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————————
class fileList : public RegisterTable {
private:
    int16_t     m_x = 0;
    int16_t     m_y = 0;
    int16_t     m_w = 0;
    int16_t     m_h = 0;
    int16_t     m_oldX = 0;
    int16_t     m_oldY = 0;
    uint8_t     m_lineHight = 0;
    uint8_t     m_browseOnRelease = 0;
    uint16_t    m_fileListPos = 0;
    int16_t    m_curAudioFileNr = 0;
    uint16_t    m_viewPos = 0;
    uint8_t     m_fontSize = 0;
    uint32_t    m_bgColor = 0;
    bool        m_enabled = false;
    bool        m_clicked = false;
    bool        m_state = false;
    char*       m_name = NULL;
    char*       m_curAudioFolder = NULL;
    char*       m_curAudioPath = NULL;
    char*       m_curAudioName = NULL;
    char*       m_fileItemsPos = NULL;
    releasedArg m_ra;
public:
    fileList(const char* name){
        register_object(this);
        if(name) m_name  = x_ps_strdup(name);
        else     m_name  = x_ps_strdup("fileList");
        m_fileItemsPos   = x_ps_malloc(30);
        m_curAudioFolder = x_ps_malloc(1024);
        m_curAudioPath   = x_ps_malloc(1024);
        m_curAudioName   = x_ps_malloc(1024);
        m_bgColor = TFT_BLACK;
        m_enabled = false;
        m_clicked = false;
        m_state = false;
        m_ra.arg1 = NULL;
        m_ra.arg2 = NULL;
        m_ra.val1 = 0;
        m_ra.val2 = 0;
    }
    ~fileList(){
        if(m_name){free(m_name); m_name = NULL;}
        if(m_fileItemsPos)  {free(m_fileItemsPos);   m_fileItemsPos   = NULL;}
        if(m_curAudioFolder){free(m_curAudioFolder); m_curAudioFolder = NULL;}   //   /audiofiles/folder1
        if(m_curAudioName  ){free(m_curAudioName);   m_curAudioName   = NULL;}   //   song.mp3
        if(m_curAudioPath  ){free(m_curAudioPath);   m_curAudioPath   = NULL;}   //   /audiofiles/folder1/song.mp3
    }
    void begin(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint8_t fontSize){
        m_x = x; // x pos
        m_y = y; // y pos
        m_w = w; // width
        m_h = h; // high
        m_lineHight = m_h / 10;
        m_fontSize = fontSize;
        m_enabled = false;
    }
    const char* getName(){
        return m_name;
    }
    bool isEnabled() {
        return m_enabled;
    }
    void show(const char* cur_AudioFolder, uint16_t curAudioFileNr){
        m_browseOnRelease = 0;
        m_clicked = false;
        m_enabled = true;
        if(!cur_AudioFolder) {log_w("cur_AudioFolder set to /audiofiles"); strcpy(m_curAudioFolder, (char*)"/audiofiles");}
        else m_curAudioFolder = strcpy(m_curAudioFolder, cur_AudioFolder);
        m_curAudioFileNr = curAudioFileNr;
        _SD_content.listFilesInDir(m_curAudioFolder, true, false);
        if(m_curAudioFileNr >= _SD_content.getSize()) m_curAudioFileNr = _SD_content.getSize(); // guard
        m_viewPos = calculateDisplayStartPosition(_SD_content.getSize(), m_curAudioFileNr);        // calculate viewPos
        audioFileslist(m_viewPos);
    }
    void hide(){
        m_enabled = false;
        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
    }
    void disable(){
        m_enabled = false;
    }
    bool positionXY(uint16_t x, uint16_t y){
        if(x < m_x) return false;
        if(y < m_y) return false;
        if(x > m_x + m_w) return false;
        if(y > m_y + m_h) return false;
        if(m_clicked == false){m_oldX = x; m_oldY = y;}
        if(m_enabled) m_clicked = true;
        if(graphicObjects_OnClick) graphicObjects_OnClick((const char*)m_name, m_enabled);
        if(!m_enabled) return false;
        return true;
    }
    bool released(uint16_t x, uint16_t y){
        if(!m_enabled) return false;
        if(!m_clicked) return false;

        hasReleased(x - m_x, y - m_y);
        m_clicked = false;

        char* fileName = NULL;

        if(m_browseOnRelease == 1)  {   if(m_viewPos + 9 >= _SD_content.getSize()) { goto exit; }       // wipe up
                                        else                     {m_viewPos += 9; m_ra.val1 = 1;}
                                        audioFileslist(m_viewPos);
                                    }
        if(m_browseOnRelease == 2)  {   if(m_viewPos == 0) { goto exit; }                               // wipe down
                                        if(m_viewPos >  9) {m_viewPos -= 9; m_ra.val1 = 1;}
                                        else               {m_viewPos  = 0; m_ra.val1 = 1;}
                                        audioFileslist(m_viewPos);
                                    }
        if(m_browseOnRelease == 3)  {   m_curAudioFolder[lastIndexOf(m_curAudioFolder, '/')] = '\0';    // previous folder
                                        m_curAudioFileNr = 0;
                                        m_viewPos = 0;
                                        _SD_content.listFilesInDir(m_curAudioFolder, true, false);
                                        m_ra.val1 = 2;
                                        m_ra.val2 = m_curAudioFileNr;
                                        m_ra.arg1 = m_curAudioFolder;
                                    }
        if(m_browseOnRelease == 4)  {   m_viewPos += m_fileListPos;                                     // next folder
                                        int16_t idx = m_viewPos -1;
                                        tft.setTextColor(TFT_CYAN);
                                        tft.setFont(m_fontSize);
                                        tft.writeText(_SD_content.getColouredSStringByIndex(idx), 20, m_y + (m_fileListPos) * m_lineHight, m_w - 20, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
                                        strcpy(m_curAudioFolder, _SD_content.getFilePathByIndex(idx));
                                        m_curAudioFileNr = 0;
                                        m_viewPos = 0;
                                        _SD_content.listFilesInDir(m_curAudioFolder, true, false);
                                        m_ra.val1 = 2;                     // isfolder
                                        m_ra.val2 = m_viewPos;
                                        m_ra.arg1 = m_curAudioFolder;
                                    }
        if(m_browseOnRelease == 5)  {   m_viewPos += m_fileListPos;                                     // play file
                                        tft.setTextColor(TFT_CYAN);
                                        tft.setFont(m_fontSize);
                                        tft.writeText(m_curAudioName, 20, m_y + (m_fileListPos) * m_lineHight, m_w - 20, m_lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
                                        m_ra.arg1 = m_curAudioFolder;      // fileFolder
                                        m_ra.arg2 = m_curAudioName;        // fileName
                                        m_ra.arg3 = m_curAudioPath;        // filePath
                                        m_ra.val1 = 3;                     // isfile
                                        m_ra.val2 = m_viewPos - 1;         // fileNr (is curAudioFileNr)
                                    }
    exit:
        m_browseOnRelease = 0;
        m_oldX = 0; m_oldY = 0;
        if(graphicObjects_OnRelease) graphicObjects_OnRelease((const char*)m_name, m_ra);
        if(fileName){free(fileName); fileName = NULL;}
        m_ra.val1 = 0;
        m_ra.arg1 = NULL;
        return true;
    }

    void prevPage(){ // from IR control
        if(m_viewPos == 0) return;
        if(m_viewPos > 9) {
            m_viewPos -= 9;
            m_curAudioFileNr -= 9;
        }
        else {
            m_curAudioFileNr -= m_viewPos;
            m_viewPos = 0;
        }
        audioFileslist(m_viewPos);
        return;
    }
    void nextPage(){ // from IR control
        if(m_viewPos + 9 <= _SD_content.getSize() - 1) {
            m_viewPos += 9;
            m_curAudioFileNr += 9;
            if(m_curAudioFileNr > _SD_content.getSize() - 1) m_curAudioFileNr = _SD_content.getSize() - 1;
            audioFileslist(m_viewPos);
            return;
        }
    }

