schreibfaul1/ESP32-MiniWebRadio/src/common.h
/*
Audio Files                   Vol11    15:32:18
/audiofiles/myPlaylist                   1-9/11     <- parent folder  m_curAudioFileNr = -1
  320_test.mpr 9610227                              <-                m_curAudioFileNr - m_viewpos = 0
  If_I_Had_a_Chicken_mono_mp3 1591510
  If_I_Had_a_Chicken_mono_16bit.wav 13257580
  If_I_Had_a_Chicken_mono_8bit.wav 6628972
  If_I_Had_a_Chicken_stereo_mp3 6012554
  If_I_Had_a_Chicken_stereo_16bit.wav 26514608
  If_I_Had_a_Chicken_stereo_8bit.wav 1327260
  beep.mp3 75302
  click.mp3 3360                                    <-                m_curAudioFileNr - m_viewpos = 8
  003       0:00      0K       IP:192.168.178.24
*/

    void prevFile(){ // from IR control
        if(m_curAudioFileNr < 0) return;
        uint8_t lineHight = m_h / 10;

        if(m_curAudioFileNr && m_curAudioFileNr - m_viewPos == 0) {
            if(m_viewPos >= 9) m_viewPos -= 9; else m_viewPos = 0;
            m_curAudioFileNr--; audioFileslist(m_viewPos); return;
        }
        tft.setFont(m_fontSize);
        if(_SD_content.isDir(m_curAudioFileNr)) tft.setTextColor(TFT_ORANGE); // is folder
        else tft.setTextColor(TFT_WHITE);                                    // is file
        tft.writeText(_SD_content.getColouredSStringByIndex(m_curAudioFileNr), 20, m_y + (m_curAudioFileNr - m_viewPos + 1)*lineHight, m_w - 20, lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
        m_curAudioFileNr--;

        if(m_curAudioFileNr == -1) { // parent folder
            tft.setTextColor(TFT_VIOLET);
            tft.writeText(m_curAudioFolder, 10, m_y, m_w - 10, lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
            return;
        }
        if(_SD_content.isDir(m_curAudioFileNr)) tft.setTextColor(TFT_VIOLET); // is folder
        else tft.setTextColor(TFT_MAGENTA);  // current file
        tft.writeText(_SD_content.getColouredSStringByIndex(m_curAudioFileNr), 20, m_y + (m_curAudioFileNr - m_viewPos + 1)*lineHight, m_w - 20, lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
    }
    void nextFile(){ // from IR control
        if(m_curAudioFileNr == _SD_content.getSize() - 1) return;
        if(m_curAudioFileNr - m_viewPos == 8) {
            if(m_viewPos + 9 < _SD_content.getSize()) m_viewPos += 9; else m_viewPos = _SD_content.getSize() - 1;
            m_curAudioFileNr++; audioFileslist(m_viewPos); return;
        }
        tft.setFont(m_fontSize);
        uint8_t lineHight = m_h / 10;
        if(m_curAudioFileNr == -1){
            tft.setTextColor(TFT_LIGHTBROWN);// is parent folder
            tft.writeText(m_curAudioFolder, 10, m_y, m_w - 10, lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
        }
        else{
            if(_SD_content.isDir(m_curAudioFileNr)) tft.setTextColor(TFT_ORANGE); // is folder
            else tft.setTextColor(TFT_WHITE);// is file
            tft.writeText(_SD_content.getColouredSStringByIndex(m_curAudioFileNr), 20, m_y + (m_curAudioFileNr - m_viewPos + 1)*lineHight, m_w - 20, lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
        }
         m_curAudioFileNr++;
        if(_SD_content.isDir(m_curAudioFileNr)) tft.setTextColor(TFT_VIOLET); // is folder
        else tft.setTextColor(TFT_MAGENTA);  // current file
        tft.writeText(_SD_content.getColouredSStringByIndex(m_curAudioFileNr), 20, m_y + (m_curAudioFileNr - m_viewPos + 1)*lineHight, m_w - 20, lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
    }
    const char* getSelectedFile(){
        if(m_curAudioFileNr == -1) { // parent folder
            if(!strcmp(m_curAudioFolder, "/audiofiles")) return NULL;
            m_curAudioFolder[lastIndexOf(m_curAudioFolder, '/')] = '\0';    // previous folder
            m_curAudioFileNr = 0;
            m_viewPos = 0;
            _SD_content.listFilesInDir(m_curAudioFolder, true, false);
            show(m_curAudioFolder, 0);
            return NULL;
        }
        if(_SD_content.isDir(m_curAudioFileNr)){
            strcpy(m_curAudioPath, _SD_content.getFilePathByIndex(m_curAudioFileNr));
            show(m_curAudioPath, 0);
            return NULL;
        }
        return _SD_content.getFilePathByIndex(m_curAudioFileNr);
    }


private:
    void audioFileslist(uint16_t viewPos) {
        // guard -------------------------------------------------------------------------------------------------------------------------------------
        if(_SD_content.getSize() == 0) { ;  }                                           // folder empty
        if(viewPos >= _SD_content.getSize()) { viewPos = _SD_content.getSize() - 1; }   // viewPos too high
        //--------------------------------------------------------------------------------------------------------------------------------------------

        auto triangleUp = [&](int16_t x, int16_t y, uint8_t s) { tft.fillTriangle(x + s, y + 0, x + 0, y + 2 * s, x + 2 * s, y + 2 * s, TFT_RED); };
        auto triangleDown = [&](int16_t x, int16_t y, uint8_t s) { tft.fillTriangle(x + 0, y + 0, x + 2 * s, y + 0, x + s, y + 2 * s, TFT_RED); };

        tft.fillRect(m_x, m_y, m_w, m_h, m_bgColor);
        tft.setFont(m_fontSize);
        uint8_t lineHight = m_h / 10;
        tft.setTextColor(TFT_LIGHTBROWN);
        tft.writeText(m_curAudioFolder, 10, m_y, m_w - 10, lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
        tft.setTextColor(TFT_WHITE);
        for (uint8_t pos = 1; pos < 10; pos++) {
            if (pos == 1 && viewPos > 0 && _SD_content.getSize()) {
                tft.setTextColor(TFT_AQUAMARINE);
                triangleUp(0, m_y + (pos * lineHight), lineHight / 3.5);
            }
            if (pos == 9 && viewPos + 9 < _SD_content.getSize()) {
                tft.setTextColor(TFT_AQUAMARINE);
                triangleDown(0, m_y + (pos * lineHight), lineHight / 3.5);
            }
            if (viewPos + pos > _SD_content.getSize()) break;
            if (_SD_content.isDir(pos + viewPos - 1)){
                if (pos + viewPos - 1 == m_curAudioFileNr) tft.setTextColor(TFT_VIOLET); // is current folder
                else tft.setTextColor(TFT_ORANGE); // is folder
            }
            else {
                if (pos + viewPos - 1 == m_curAudioFileNr) tft.setTextColor(TFT_MAGENTA); // current file
                else tft.setTextColor(TFT_WHITE); // is file
            }
            tft.writeText(_SD_content.getColouredSStringByIndex(pos + viewPos - 1), 20, m_y + (pos)*lineHight, m_w - 20, lineHight, TFT_ALIGN_LEFT, TFT_ALIGN_CENTER, true, true);
        }
        uint16_t firstVal = viewPos + 1;
        uint16_t secondVal = firstVal + 8;
        if(secondVal > _SD_content.getSize()) secondVal = _SD_content.getSize();
        sprintf(m_fileItemsPos, "%i-%i/%i", firstVal, secondVal, _SD_content.getSize()); // shows the current items pos e.g. "30-39/210"
        tft.setTextColor(TFT_ORANGE);
        tft.writeText(m_fileItemsPos, 10, m_y, m_w - 10, m_lineHight, TFT_ALIGN_RIGHT, TFT_ALIGN_CENTER, true, true);
        return;
  }

