schreibfaul1/ESP32-MiniWebRadio/src/common.h
const char stations_json[] =
    "[[\"*\",\"D\",\"0N 70s\",\"http://0n-70s.radionetz.de:8000/0n-70s.mp3\"],"
    "[\"*\",\"D\",\"0N 80s\",\"http://0n-80s.radionetz.de:8000/0n-80s.mp3\"],"
    "[\"*\",\"D\",\"0N 90s\",\"http://0n-90s.radionetz.de:8000/0n-90s.mp3\"],"
    "[\"*\",\"D\",\"0N Charts\",\"http://0n-charts.radionetz.de:8000/0n-charts.mp3\"],"
    "[\"*\",\"D\",\"0N Dance\",\"http://0n-dance.radionetz.de:8000/0n-dance.mp3\"],"
    "[\"*\",\"D\",\"0N Disco\",\"http://0n-disco.radionetz.de:8000/0n-disco.mp3\"],"
    "[\"*\",\"D\",\"1000 Oldies\",\"http://c3.auracast.net:8010/stream\"],"
    "[\"*\",\"D\",\"Eurodance\",\"http://www.laut.fm/eurodance\"],"
    "[\"\",\"D\",\"extra-radio 88.0\",\"https://www.extra-radio.de/stream/listen.m3u\"],"
    "[\"*\",\"D\",\"Hitradio SKW\",\"http://server4.streamserver24.com:2199/tunein/hitradio.asx\"],"
    "[\"*\",\"D\",\"MacSlon's Irish Pub Radio\",\"http://macslons-irish-pub-radio.stream.laut.fm/macslons-irish-pub-radio\"],"
    "[\"\",\"GR\",\"Άνοιξη 100.7\",\"http://solid1.streamupsolutions.com:55023/stream\"],"
    "[\"\",\"RU\",\"НАШЕ Радио\",\"http://nashe1.hostingradio.ru/nashe-128.mp3\"],"
    "[\"\",\"RU\",\"Радио Русские Песни\",\"http://listen.rusongs.ru/ru-mp3-128\"],"
    "[\"\",\"BG\",\"Свежа България\",\"http://31.13.223.148:8000/fresh.mp3\"],"
    "[\"\",\"CH\",\"SWISS POP\",\"https://stream.srg-ssr.ch/rsp/aacp_48.asx\"],"
    "[\"\",\"BG\",\"BGRADIO\",\"http://play.global.audio/bgradio_low.ogg\"],"
    "[\"\",\"D\",\"knixx.fm\",\"http://s1.knixx.fm:5347/dein_webradio_vbr.opus\"],"
    "[\"*\",\"D\",\"- 0 N - Christmas on Radio\",\"https://0n-christmas.radionetz.de/0n-christmas.aac\"],"
    "[\"*\",\"UK\",\"BBC 6music\",\"http://as-hls-ww-live.akamaized.net/pool_904/live/ww/bbc_6music/bbc_6music.isml/bbc_6music-audio=96000.norewind.m3u8\"],"
    "[\"\",\"D\",\"- 0 N - Movies on Radio\",\"https://0n-movies.radionetz.de/0n-movies.mp3\"],"
    "[\"*\",\"D\",\"- 0 N - Top 40 on Radio\",\"https://0n-top40.radionetz.de/0n-top40.mp3\"],"
    "[\"\",\"D\",\"ROCKANTENNE Alternative (mp3)\",\"https://stream.rockantenne.de/alternative/stream/mp3\"],"
    "[\"\",\"P\",\"Gra Wrocław\",\"http://rmfstream2.interia.pl:8000/radio_gra_wroc\"],"
    "[\"*\",\"RU\",\"Classic EuroDisco Радио\",\"https://live.radiospinner.com/clsscrdsc-96\"],"
    "[\"*\",\"D\",\"Hit Radio FFH - Soundtrack (AAC+)\",\"http://streams.ffh.de/ffhchannels/aac/soundtrack.m3u\"]]";

const char aesKey [] = "mysecretkey12345";

const char voice_time_de[24][50] = {
    "Beim dritten Ton ist es genau Mitternacht",
    "Beim dritten Ton ist es genau ein Uhr",
    "Beim dritten Ton ist es genau zwei Uhr",
    "Beim dritten Ton ist es genau drei Uhr",
    "Beim dritten Ton ist es genau vier Uhr",
    "Beim dritten Ton ist es genau fünf Uhr",
    "Beim dritten Ton ist es genau sechs Uhr",
    "Beim dritten Ton ist es genau sieben Uhr",
    "Beim dritten Ton ist es genau acht Uhr",
    "Beim dritten Ton ist es genau neun Uhr",
    "Beim dritten Ton ist es genau zehn Uhr",
    "Beim dritten Ton ist es genau elf Uhr",
    "Beim dritten Ton ist es genau zwölf Uhr",
    "Beim dritten Ton ist es genau dreizehn Uhr",
    "Beim dritten Ton ist es genau vierzehn Uhr",
    "Beim dritten Ton ist es genau fünfzehn Uhr",
    "Beim dritten Ton ist es genau sechszehn Uhr",
    "Beim dritten Ton ist es genau siebzehn Uhr",
    "Beim dritten Ton ist es genau achtzehn Uhr",
    "Beim dritten Ton ist es genau neunzehn Uhr",
    "Beim dritten Ton ist es genau zwanzig Uhr",
    "Beim dritten Ton ist es genau einundzwanzig Uhr",
    "Beim dritten Ton ist es genau zweiundzwanzig Uhr",
    "Beim dritten Ton ist es genau dreiundzwanzig Uhr"
};

inline const char* aes_encrypt(const char* input) {
    static char* output = NULL;
    uint16_t len = strlen(input) / 16;
    len++;
    if(output){free (output); output = NULL;}
    output = (char*) x_ps_calloc((len * 16) + 1, 1);
    mbedtls_aes_context aes;
    mbedtls_aes_init(&aes);
    mbedtls_aes_setkey_enc(&aes, (const unsigned char*) aesKey, 128);
    mbedtls_aes_crypt_ecb(&aes, MBEDTLS_AES_ENCRYPT, (const unsigned char*) input, (unsigned char*) output);
    mbedtls_aes_free(&aes);
    return output;
}

inline const char* aes_decrypt(const char* input) {
    static char* output = NULL;
    uint16_t len = strlen(input) + 1;
    if(output){free (output); output = NULL;}
    output = (char*) x_ps_calloc(len, 1);
    mbedtls_aes_context aes;
    mbedtls_aes_init(&aes);
    mbedtls_aes_setkey_dec(&aes, (const unsigned char*) aesKey, 128);
    mbedtls_aes_crypt_ecb(&aes, MBEDTLS_AES_DECRYPT, (const unsigned char*) input, (unsigned char*) output);
    mbedtls_aes_free(&aes);
    return output;
}

inline void encode_base64(const unsigned char* input, size_t input_len) {
    // Buffer-Größe berechnen für Base64-Kodierung
    size_t buffer_size = ((input_len + 2) / 3) * 4 + 1;
    unsigned char* output = (unsigned char*)malloc(buffer_size);  // Dynamischer Buffer

    size_t output_len;
    int ret = mbedtls_base64_encode(output, buffer_size, &output_len, input, input_len);

    if (ret == 0) {
        printf("Base64-Kodierung: %s\n", output);
    } else {
        printf("Fehler bei der Base64-Kodierung\n");
    }

    free(output);  // Buffer freigeben
}

inline void decode_base64(const char* input, size_t input_len) {
    size_t output_len;
    // Buffer-Größe berechnen für Base64-Dekodierung
    size_t buffer_size = (input_len  / 4) * 3 + 1;
    unsigned char* output = (unsigned char*)malloc(buffer_size);  // Dynamischer Buffer

    // Dekodierung
    int ret = mbedtls_base64_decode(output, sizeof(output), &output_len, (const unsigned char*)input, input_len);

    if (ret == 0) {
        printf("Dekodierter Text: %s\n", output);
    } else {
        printf("Fehler bei der Base64-Dekodierung\n");
    }
    free(output);  // Buffer freigeben
}
